// 다양한 데이터 타입을 가진 객체 사용
// 연관배열*활용법
// 연관배열은 key하나와 value값 하나가 연관되어 있으며 키를 통해 연관되는 값을 얻을 수 있음
// 연상배열이나 결합형 배열, map, dictionary라고 불리기도 함

// 객체는 js의 기본데이터 타입중 하나
// 객체는 여러가지 속성을 가짐
// 속성은 키와 값의 조합으로 만들어짐

//개인 정보의 데이터 객체
const person = {
    id: 1,
    name: '거북이',
    age: 28
}

// 속성의 데이터 타입도 무제한
// 숫자, 문자열, 배열, 객체, 함수 모두 속성으로 사용가능

const person = {
    id: 1,
    name: '거북이',
    age: 28
};

console.log(person);

// Object
// id: 1
// name: "거북이"
// age: 28
// > __proto__ : object
// 위 결과에 표시된 Object객체는 모든 확장 객체의 기본
// 기본객체에 사용할 수 있는 구문은 다른객체에도 사용가능

