// 타임스탬프로 날짜와 시간을 계산하고 싶을 때

// Date.parse()는 인수를 타임스탬프로 변환한다
// 타임스탬프는 1970년 1월 1일 00:00:00부터 현재까지 경과 시간을 나타낼때 밀리초(1/1000초)이다.

// 프로그래밍시 타임스탬프를 기준하여 시간을 계산하는 경우 메소드의 사용이 가능
// Date.parse()메소드는 Date 인스턴스의 getTime() 메소드와 같은 값을 가진다.

//과거시간
const num1 = Date.parse('2020/12/28');
console.log(num1);  //결과: 1609081200000

//과거시간
const num2  = Date.parse(12282020);
console.log(num2);  // 결과 160908120000

//현재 시간의 타임스탬프는 Date.new()를 통해 가져오기 가능
const num = Date.now();
console.log(num);   // 결과: 160908100000
